_Rarzrabotki/Rarus/USO2/DataProcessors/уатИзменениеНормРасходаТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>уатИзменениеНормРасходаТоплива</Name>
			<Comment>(уат)</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатНормыРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатНормыРасходаГСМ</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛинейнаяНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЕздку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЗапуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаИзменениеСобственногоВеса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОперацию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОтопитель</Name>
					<Comment>Норма на отопитель, кондиционер, климат-контроль</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемЛитры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемПроцентомОтБазовой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота7</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота8</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота9</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота10</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу9</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаТранспортнуюРаботу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаСпециальнаяНаМоточас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СезоннаяНадбавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НадбавкаНаКондиционер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПростоиДляРасчетаНормыМоточасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>ГСМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>Модель ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатГруппыГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатГруппыГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Масло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисадкиИТехническиеЖидкости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/уатИзменениеНормРасходаТоплива/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	
	флИзменятьНормуОснТоплива = Истина;
	ПереключательРежимаРаботы = "0";
	Элементы.ТС.Видимость = ?(ПереключательРежимаРаботы = "1", Истина, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФлажокЛинейныеНормыПриИзменении(Элемент)
	Элементы.Группа1.Доступность = ФлажокЛинейныеНормы;
	ПереключательПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПроцентПриИзменении(Элемент)
	ПереключательПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ФлажокСезонныеНадбавкиПриИзменении(Элемент)
	Элементы.Группа3.Доступность = ФлажокСезонныеНадбавки;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекВключатьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
	ТекущиеДанные.Включать = ТекущиеДанные.Включать % 2;
	ПроставитьПометкиВниз(ТекущиеДанные);
	ПроставитьПометкиВверх(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТопливоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("ЗначениеГСМДоИзменения, ИмяПроцедурыОписаниеОповещения", Топливо, "ОписаниеОповещенияВыбораГСМ");
	уатЗащищенныеФункцииКлиент.ВыбратьГСМ(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"), ЭтаФорма, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ПереключательРежимаРаботыПриИзменении(Элемент)
	ТекстНСТР = ?(ПереключательРежимаРаботы = "0", Нстр("en = 'Group / Model'; ru = 'Группа / Модель'"),
	Нстр("en = 'Group / Vehicle'; ru = 'Группа / ТС'"));
	Элементы.ДеревоНастроекНастройка.Заголовок = ТекстНСТР;
	Элементы.ТС.Видимость = ?(ПереключательРежимаРаботы = "1", Истина, Ложь);
	ЗаполнитьТабЧасть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьПометки(1);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьПометки(0);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройки(Команда)
	ЗаполнитьТабЧасть();
КонецПроцедуры

&НаКлиенте
Процедура ДействиеВыполнить(Команда)
	Если ДеревоНастроек.ПолучитьЭлементы().Количество() = 0 Тогда
		ТекстНСТР = ?(ПереключательРежимаРаботы = "0", НСтр("en='Not completed list of models!';ru='Не заполнен список моделей!'"),
		НСтр("en='Not completed list of vehicles!';ru='Не заполнен список ТС!'"));
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	Если Не ФлажокЛинейныеНормы И Не ФлажокСезонныеНадбавки Тогда
		ПоказатьПредупреждение(Неопределено, "Должен быть включен хотя бы один из флажков 
		|""Изменить линейные нормы расхода топлива"" или
		|""Изменить сезонные надбавки"" !");
		Возврат;
	КонецЕсли;
	
	Если Не флИзменятьНормуОснТоплива И Не флИзменятьНормуДопТоплива Тогда 
		ПоказатьПредупреждение(Неопределено, "Должен быть включен хотя бы один из флажков 
		|""Изменять норму основного топлива"" или
		|""Изменять норму дополнительного топлива"" !");
		Возврат;
	КонецЕсли;
	
	Если ФлажокЛинейныеНормы Тогда
		Если ПереключательПроцент = 0 Тогда
			Если ЗначениеПроцента = 0 Тогда
				ПоказатьПредупреждение(Неопределено, "Не указан процент изменения!");
				Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МодельТС) И Не ЗначениеЗаполнено(Топливо)
		И Не ЗначениеЗаполнено(ТС) И Не ЗначениеЗаполнено(ТипДвигателя) И Не ЗначениеЗаполнено(ТипТС)
		И Не ЗначениеЗаполнено(Организация) Тогда
		ТекстНСТР = СтрШаблон(НСтр("en='Selection is not installed. The list will be filled with all %1 for which fuel consumption rates were previously established.';ru='Отбор не установлен. Список будет заполнен всеми %1, для которых ранее были установлены нормы расхода ГСМ.'"),
		?(ПереключательРежимаРаботы = "0", НСтр("en = 'models'; ru = 'моделями'"), НСтр("en = 'vehicles'; ru = 'ТС'")))+ Символы.ПС + 
		НСтр("en='Do you want to continue?';ru='Продолжить?'");
		ПоказатьВопрос(
		Новый ОписаниеОповещения("ДействиеВыполнитьЗавершение", ЭтотОбъект), 
		ТекстНСТР,
		РежимДиалогаВопрос.ДаНет,
		,
		КодВозвратаДиалога.Нет
		);
	Иначе 
		Для Каждого СтрокаГруппы Из ДеревоНастроек.ПолучитьЭлементы() Цикл
			Если СтрокаГруппы.ЭтоГруппа Тогда
				Для Каждого Строка Из СтрокаГруппы.ПолучитьЭлементы() Цикл
					РассчитатьИзменениеНормыРасходаТоплива(Строка);
				КонецЦикла;	
			Иначе
				РассчитатьИзменениеНормыРасходаТоплива(СтрокаГруппы);
			КонецЕсли;	
		КонецЦикла;
		
		ЗаполнитьТабЧастьСервер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПереключательПриИзменении()
	Элементы.ЗначениеПроцента.Доступность = (ПереключательПроцент = 0);
	Элементы.ЗначениеНормы.Доступность = (ПереключательПроцент = 1);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧастьСервер()
	
	ДеревоНастроек_ = РеквизитФормыВЗначение("ДеревоНастроек");
	ДеревоНастроек_.Строки.Очистить();
	
	Если ПереключательРежимаРаботы = "0" Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА уатМоделиТС.Родитель.Наименование = """"
		|			ТОГДА """"
		|		ИНАЧЕ уатМоделиТС.Родитель.Наименование
		|	КОНЕЦ КАК Группа,
		|	уатМоделиТС.Ссылка
		|ИЗ
		|	РегистрСведений.уатНормыРасходаГСМ.СрезПоследних КАК уатНормыРасходаГСМСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатМоделиТС КАК уатМоделиТС
		|		ПО уатНормыРасходаГСМСрезПоследних.МодельТС = уатМоделиТС.Ссылка
		|ГДЕ
		|	НЕ уатМоделиТС.ПометкаУдаления";
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатНормыРасходаГСМСрезПоследних.Организация = &Организация";
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;   
		
		Если ЗначениеЗаполнено(МодельТС) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатМоделиТС.Ссылка В Иерархии (&МодельТС)";
			Если ТипЗнч(МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
				Запрос.УстановитьПараметр("МодельТС", МодельТС);
			Иначе 
				Запрос.УстановитьПараметр("МодельТС", МодельТС.уатМодель);
			КонецЕсли;
		КонецЕсли;   
		
		Если Не ТипДвигателя.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатМоделиТС.ТипДвигателя В Иерархии (&ТипДвигателя)";
			Запрос.УстановитьПараметр("ТипДвигателя", ТипДвигателя);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипТС) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатМоделиТС.ТипТС В Иерархии (&ТипТС)";
			Запрос.УстановитьПараметр("ТипТС", ТипТС);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Топливо) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И (уатМоделиТС.ОсновноеТопливо = &Топливо ИЛИ уатМоделиТС.ДополнительноеТопливо = &Топливо)";
			Запрос.УстановитьПараметр("Топливо", Топливо);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "                  
		|УПОРЯДОЧИТЬ ПО
		|	Группа,
		|	Ссылка";
	Иначе
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	"""" КАК Группа,
		|	уатТС.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.уатНормыРасходаГСМ.СрезПоследних КАК уатНормыРасходаГСМСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК уатТС
		|		ПО уатНормыРасходаГСМСрезПоследних.МодельТС = уатТС.Ссылка
		|ГДЕ
		|	НЕ уатТС.ПометкаУдаления";
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатНормыРасходаГСМСрезПоследних.Организация = &Организация";
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;   
		
		Если ЗначениеЗаполнено(МодельТС) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатТС.Модель В Иерархии (&МодельТС)";
			Запрос.УстановитьПараметр("МодельТС", МодельТС);
		КонецЕсли;   
		
		Если Не ТипДвигателя.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатТС.Модель.ТипДвигателя В Иерархии (&ТипДвигателя)";
			Запрос.УстановитьПараметр("ТипДвигателя", ТипДвигателя);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипТС) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатТС.ТипТС В Иерархии (&ТипТС)";
			Запрос.УстановитьПараметр("ТипТС", ТипТС);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Топливо) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И (уатТС.Модель.ОсновноеТопливо = &Топливо ИЛИ уатТС.Модель.ДополнительноеТопливо = &Топливо)";
			Запрос.УстановитьПараметр("Топливо", Топливо);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТС) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И уатТС.Ссылка = &ТС";
			Запрос.УстановитьПараметр("ТС", ТС);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "                  
		|УПОРЯДОЧИТЬ ПО
		|	Группа,
		|	Ссылка";
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	Родитель = "";
	Пока Результат.Следующий() Цикл
		спр = Результат.Ссылка;
    	Если Не спр.ЭтоГруппа Тогда
			Если спр.Родитель <> Родитель И Не спр.Родитель.Пустая() Тогда
				СтрокаГруппы = ДеревоНастроек_.Строки.Добавить();
				СтрокаГруппы.Настройка = спр.Родитель.Наименование;
				СтрокаГруппы.Включать  = Ложь;
				СтрокаГруппы.ЭтоГруппа = спр.Родитель.ЭтоГруппа;
				Родитель = спр.Родитель;
			КонецЕсли;
			
			Если Не спр.Родитель.Пустая() Тогда
				СтрокаНастройки = СтрокаГруппы.Строки.Добавить();
			Иначе
				СтрокаНастройки = ДеревоНастроек_.Строки.Добавить();
			КонецЕсли;
			СтрокаНастройки.Настройка = спр.Наименование;
			СтрокаНастройки.Включать  = Ложь;
			СтрокаНастройки.ЭтоГруппа = спр.ЭтоГруппа;
			СтрокаНастройки.Значение  = спр;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоНастроек_, "ДеревоНастроек");
	
	Если ДеревоНастроек.ПолучитьЭлементы().Количество() = 0 Тогда
		ТекстНСТР = НСтр("en = 'Could not pick items. Perhaps the fuel consumption rates have not yet been established, or no element corresponds to the selection. For the initial installation of fuel consumption rates, use the form of the element of the directory.'; ru = 'Не удалось подобрать элементы. Возможно, нормы расхода ГСМ еще не были установлены или ни один элемент не соответствует отборам. Для первоначальной установки норм расхода ГСМ используйте форму элемента справочника.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабЧасть()
	
	Если Не ЗначениеЗаполнено(МодельТС) И Не ЗначениеЗаполнено(ТС) И Не ЗначениеЗаполнено(Топливо) 
			И Не ЗначениеЗаполнено(ТипДвигателя) И Не ЗначениеЗаполнено(ТипТС) И Не ЗначениеЗаполнено(Организация) Тогда
		ТекстНСТР = СтрШаблон(НСтр("en='Selection is not installed. The list will be filled with all %1 for which fuel consumption rates were previously established.';ru='Отбор не установлен. Список будет заполнен всеми %1, для которых ранее были установлены нормы расхода ГСМ.'"),
		?(ПереключательРежимаРаботы = "0", НСтр("en = 'models'; ru = 'моделями'"), НСтр("en = 'vehicles'; ru = 'ТС'")))+ Символы.ПС + 
					НСтр("en='Do you want to continue?';ru='Продолжить?'");
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ЗаполнитьТабЧастьЗавершение", ЭтотОбъект), 
			ТекстНСТР,
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Нет
		);
	Иначе 
		ЗаполнитьТабЧастьФрагмент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабЧастьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;	
    
    ЗаполнитьТабЧастьФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ДействиеВыполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого СтрокаГруппы Из ДеревоНастроек.ПолучитьЭлементы() Цикл
		Если СтрокаГруппы.ЭтоГруппа Тогда
			Для Каждого Строка Из СтрокаГруппы.ПолучитьЭлементы() Цикл
				РассчитатьИзменениеНормыРасходаТоплива(Строка);
			КонецЦикла;	
		Иначе
			РассчитатьИзменениеНормыРасходаТоплива(СтрокаГруппы);
		КонецЕсли;	
	КонецЦикла;
	
	ЗаполнитьТабЧастьФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабЧастьФрагмент()
    
    ЗаполнитьТабЧастьСервер();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(флПометка)
	СтрокиДерева = ДеревоНастроек.ПолучитьЭлементы();
	Для Каждого ТекСтрока Из СтрокиДерева Цикл
		ТекСтрока.Включать = флПометка;
		ПроставитьПометкиВниз(ТекСтрока);
		ПроставитьПометкиВверх(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВниз(ТекущиеДанные)
	Потомки = ТекущиеДанные.ПолучитьЭлементы();
	Значение = ТекущиеДанные.Включать;
	Для каждого Потомок из Потомки Цикл
		Потомок.Включать = Значение;
		ПроставитьПометкиВниз(Потомок);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВверх(ТекущиеДанные)
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Если Родитель <> Неопределено Тогда
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		Потомки = Родитель.ПолучитьЭлементы();
		Для каждого Потомок из Потомки Цикл
			ВсеИстина = ВсеИстина И (Потомок.Включать = 1);
			НеВсеЛожь = НеВсеЛожь ИЛИ Булево(Потомок.Включать);
		КонецЦикла;
		Если ВсеИстина Тогда
			Родитель.Включать = 1;
		ИначеЕсли НеВсеЛожь Тогда
			Родитель.Включать = 2;
		Иначе
			Родитель.Включать = 0;
		КонецЕсли;
		ПроставитьПометкиВверх(Родитель);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьНормуТоплива(СписокНорм, ДатаИзменения, ФлажокЛинейныеНормы, ПереключательПроцент, ЗначениеНормы, ЗначениеПроцента, ФлажокСезонныеНадбавки, СезоннаяНадбавка, ПереключательРежимаРаботы)
	
	Для Каждого Норма Из СписокНорм Цикл 
		НаличиеСпидометра = ?(ПереключательРежимаРаботы = "0", Норма.МодельТС.НаличиеСпидометра, Норма.МодельТС.Модель.НаличиеСпидометра);
		
		ЛинейнаяНорма = 0;
		НормаСпециальнаяНаМоточас = 0;
		Если ФлажокЛинейныеНормы Тогда
			Если НаличиеСпидометра Тогда
				Если ПереключательПроцент = 0 Тогда
					Если ЗначениеПроцента > 0 Тогда
						ЛинейнаяНорма = Норма.ЛинейнаяНорма + Норма.ЛинейнаяНорма * ЗначениеПроцента / 100;
					Иначе
						Процент = -ЗначениеПроцента;
						ЛинейнаяНорма = Норма.ЛинейнаяНорма - Норма.ЛинейнаяНорма * Процент /(100+Процент);
					КонецЕсли;
				Иначе
					ЛинейнаяНорма = ЗначениеНормы;
				КонецЕсли;
			Иначе
				Если ПереключательПроцент = 0 Тогда
					Если ЗначениеПроцента > 0 Тогда
						НормаСпециальнаяНаМоточас = Норма.НормаСпециальнаяНаМоточас + Норма.НормаСпециальнаяНаМоточас * ЗначениеПроцента / 100;
					Иначе
						Процент = -ЗначениеПроцента;
						НормаСпециальнаяНаМоточас = Норма.НормаСпециальнаяНаМоточас - Норма.НормаСпециальнаяНаМоточас * Процент /(100+Процент);
					КонецЕсли;
				Иначе
					НормаСпециальнаяНаМоточас = ЗначениеНормы;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЛинейнаяНорма             = Норма.ЛинейнаяНорма;
			НормаСпециальнаяНаМоточас = Норма.НормаСпециальнаяНаМоточас;
		КонецЕсли;
		
		Если ФлажокСезонныеНадбавки Тогда
			НормаСезоннаяНадбавка = СезоннаяНадбавка;
		Иначе
			НормаСезоннаяНадбавка = Норма.СезоннаяНадбавка;
		КонецЕсли;
		
		рсНаборЗаписей = РегистрыСведений.уатНормыРасходаГСМ.СоздатьНаборЗаписей();
		рсНаборЗаписей.Отбор.МодельТС.Установить(Норма.МодельТС);
		рсНаборЗаписей.Отбор.ГСМ.Установить(Норма.ГСМ);
		рсНаборЗаписей.Отбор.Организация.Установить(Норма.Организация);
		рсНаборЗаписей.Отбор.Период.Установить(НачалоДня(ДатаИзменения));
		рсНаборЗаписей.Прочитать();
		
		Если рсНаборЗаписей.Количество() Тогда
			НоваяНорма = рсНаборЗаписей[0];
		Иначе
			НоваяНорма = рсНаборЗаписей.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяНорма, Норма);
		
		НоваяНорма.Период                    = ДатаИзменения;
		НоваяНорма.ЛинейнаяНорма             = ЛинейнаяНорма;
		НоваяНорма.НормаСпециальнаяНаМоточас = НормаСпециальнаяНаМоточас;
		НоваяНорма.СезоннаяНадбавка          = НормаСезоннаяНадбавка;
		
		Попытка
			рсНаборЗаписей.Записать();
		Исключение
			ТекстОшибки = НСтр("en='Failed to write the changes.';ru='Не удалось записать изменения.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат ТекстОшибки;
		КонецПопытки;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНормуТоплива(Мод, Топл, ДатаИзменения, Организация)
	
	РСМетаданные = Метаданные.РегистрыСведений.уатНормыРасходаГСМ;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	РегистрСведений.уатНормыРасходаГСМ.СрезПоследних(
	|			&Дата,
	|			МодельТС = &Модель
	|				И ГСМ = &Топливо
	|				И (&Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ИЛИ Организация = &Организация)
	|				) КАК уатНормыРасходаГСМСрезПоследних");
	Запрос.УстановитьПараметр("Дата",    НачалоДня(ДатаИзменения));
	Запрос.УстановитьПараметр("Модель",  Мод);
	Запрос.УстановитьПараметр("Топливо", Топл);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив();
	Пока Выборка.Следующий() Цикл 
		ДанныеНормы = Новый Структура;
		
		Для Каждого ТекИзм Из РСМетаданные.Измерения Цикл
			ДанныеНормы.Вставить(ТекИзм.Имя, Выборка[ТекИзм.Имя]);
		КонецЦикла;
		Для Каждого ТекРес Из РСМетаданные.Ресурсы Цикл
			ДанныеНормы.Вставить(ТекРес.Имя, Выборка[ТекРес.Имя]);
		КонецЦикла;
		
		Результат.Добавить(ДанныеНормы);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьИзменениеНормыРасходаТоплива(Строка1)
	
	Если Строка1.Включать = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Модель = Строка1.Значение;
	мМодель = ?(ПереключательРежимаРаботы = "0", Модель, уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Модель, "уатМодель"));
	ОснТопливо = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(мМодель, "ОсновноеТопливо");
	ДопТопливо = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(мМодель, "ДополнительноеТопливо");
	
	Если Не ЗначениеЗаполнено(Топливо) Тогда
		Если флИзменятьНормуОснТоплива И Не уатОбщегоНазначения.уатЗначениеНеЗаполнено(ОснТопливо) Тогда
			СписокНорм = ПолучитьНормуТоплива(Модель, ОснТопливо, ДатаИзменения, Организация);
			ТекстОшибки = ИзменитьНормуТоплива(СписокНорм, ДатаИзменения, ФлажокЛинейныеНормы, ПереключательПроцент, ЗначениеНормы, ЗначениеПроцента, ФлажокСезонныеНадбавки, СезоннаяНадбавка, ПереключательРежимаРаботы);
		КонецЕсли;
		
		Если флИзменятьНормуДопТоплива И Не уатОбщегоНазначения.уатЗначениеНеЗаполнено(ДопТопливо) Тогда
			СписокНорм = ПолучитьНормуТоплива(Модель, ДопТопливо, ДатаИзменения, Организация);
			ТекстОшибки = ИзменитьНормуТоплива(СписокНорм, ДатаИзменения, ФлажокЛинейныеНормы, ПереключательПроцент, ЗначениеНормы, ЗначениеПроцента, ФлажокСезонныеНадбавки, СезоннаяНадбавка, ПереключательРежимаРаботы);
		КонецЕсли;
	Иначе
		Если (ОснТопливо = Топливо И флИзменятьНормуОснТоплива) Или (ДопТопливо = Топливо И флИзменятьНормуДопТоплива) Тогда
			СписокНорм = ПолучитьНормуТоплива(Модель, Топливо, ДатаИзменения, Организация);
			ТекстОшибки = ИзменитьНормуТоплива(СписокНорм, ДатаИзменения, ФлажокЛинейныеНормы, ПереключательПроцент, ЗначениеНормы, ЗначениеПроцента, ФлажокСезонныеНадбавки, СезоннаяНадбавка, ПереключательРежимаРаботы);
		Иначе
			ПоказатьПредупреждение(
				,
				НСтр("ru = 'Вид топлива в отборе не соответствует виду топлива для изменения.'")
			);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекстОшибки = "" Тогда
		ТекстОповещения = НСтр("en='Change of fuel consumption norms successfully completed.';ru='Изменение норм расхода топлива успешно завершено.'");
		ПоказатьОповещениеПользователя(
			ТекстОповещения,
			,
			ТекстОповещения,
			БиблиотекаКартинок.Успешно32
		);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияВыбораГСМ(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Топливо = Результат;
КонецПроцедуры

#КонецОбласти
